insert into statuses (status_name)
values
('на линии'),
('не на линии'),
('принят'),
('формируется'),
('водитель в пути'),
('в пути'),
('завершен'),
('отменен'),
('водитель заблокирован'),
('на рассмотрении у клиента'),
('оплата'),
('на месте'),
('на рассмотрении у водителя'),
('предзаказ принят');

insert into roles (role_name)
values
('клиент'),
('водитель'),
('водитель/админ'),
('оператор/админ'),
('главный админ'),
('заблокирован');

insert into rates (rate_name)
values
('обычный заказ'),
('покататься'),
('транзит'),
('предзаказ/обычный заказ'),
('предзаказ/покататься');

insert into keys (secret_key) 
values ('Key');